blog/content/post/ai-transformers-deep-dive.org
+++
title = "07 - AI Engineering from scratch: do self-attention ao speculative decoding"
description = "Como a arquitetura que domina 2026 funciona, peça por peça, do zero"
date = 2026-05-28T17:00:00-03:00
tags = ["AI", "transformers", "attention", "gpt", "bert", "llm", "pytorch", "python"]
draft = true
weight = 1
author = "Vitor Lobo Ramos"
+++


Todo modelo que você usa em 2026, do GPT ao Claude, do Whisper ao Stable Diffusion, é um transformer. A arquitetura não mudou fundamentalmente desde 2017. O que mudou foi escala, dados e truques de engenharia que transformaram O(N²) de "impraticável" em "roda no celular".

Este artigo vai do zero ao speculative decoding em 16 tópicos. Você vai implementar self-attention em Python puro, entender por que RoPE substituiu embeddings posicionais, ver como Mixture of Experts empacota 671 bilhões de parâmetros em 37 bilhões ativos, e aprender o truque matemático que faz speculative decoding acelerar inferência 4x sem perder qualidade. Stack: Python pra treino, Go pra servir.

* Por que transformers?

RNNs processam tokens um por um. O passo 100 espera o passo 99. Isso é O(N) em profundidade serial, e GPU detesta serial. Transformers processam todos os tokens em paralelo. O tradeoff é O(N²) de memória por O(1) de profundidade serial. A atenção é um broadcast: cada token olha pra todos os outros simultaneamente, e a GPU come isso com uma multiplicação de matrizes.

Isso explica por que transformers dominam toda modalidade. O(N²) parecia um problema em 2017 (sequências de 512 tokens). Em 2026, com Flash Attention, KV cache, GQA e janelas deslizantes, sequências de 128k tokens são rotina. RNNs e state-space models (Mamba) ainda ganham em streaming e dispositivos mínimos, mas o transformer é o tronco principal da árvore.

* Self-attention: o tijolo atômico

Self-attention é um lookup suave de banco de dados. Cada token projeta três vetores: Query ("o que estou procurando?"), Key ("o que eu contenho?") e Value ("o que eu ofereço?"). O produto Q·K diz quão relevante cada par de tokens é. O softmax transforma isso em pesos. O output é a soma ponderada dos Values.

A fórmula: ~Attention(Q,K,V) = softmax(Q @ K^T / sqrt(d_k)) @ V~. A divisão por ~sqrt(d_k)~ evita que o softmax sature quando a dimensionalidade é alta (sem isso, os gradientes desaparecem). O resultado é uma matriz N×N onde cada célula (i,j) é o quanto o token i presta atenção no token j. Cada token de saída é uma mistura ponderada de todos os tokens de entrada.

#+BEGIN_SRC python
import numpy as np

def self_attention(X, W_q, W_k, W_v, causal=False):
    Q, K, V = X @ W_q, X @ W_k, X @ W_v
    d_k = Q.shape[-1]
    scores = Q @ K.T / np.sqrt(d_k)
    if causal:
        mask = np.triu(np.ones_like(scores) * -1e9, k=1)
        scores += mask
    weights = np.exp(scores - scores.max(axis=-1, keepdims=True))
    weights /= weights.sum(axis=-1, keepdims=True)
    return weights @ V, weights

# Exemplo com 4 tokens, d_model=8
X = np.random.randn(4, 8)
W_q, W_k, W_v = [np.random.randn(8, 8) * 0.02 for _ in range(3)]
output, attn_weights = self_attention(X, W_q, W_k, W_v)
#+END_SRC

** Multi-head: muitas atenções em paralelo**

Um único head de atenção aprende um tipo de relação (sujeito-verbo, por exemplo). Multi-head attention roda ~h~ heads em paralelo, cada um com dimensão reduzida (~d_k = d_model / h~), e concatena os resultados. Heads diferentes especializam em padrões diferentes, e a GPU executa tudo como uma única multiplicação de matrizes em lote. Adicionar heads é computacionalmente grátis.

Grouped-Query Attention (GQA) é a variante de produção: todos os heads de query compartilham um conjunto menor de heads de key/value. Se você tem 32 heads de query e 8 heads de KV, o cache de inferência encolhe 4x. Llama 3, Qwen 2 e Mistral usam GQA. Multi-Query Attention (MQA) leva ao extremo com 1 head de KV. Multi-head Latent Attention (MLA, DeepSeek-V3) comprime KV ainda mais com projeções de baixo posto.

