ai-transformers-deep-dive/index.html
<!DOCTYPE html>
<html lang="pt-br">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="icon" href="data:,">
  <title>07 - AI Engineering from scratch: do self-attention ao speculative decoding — lobovit</title>
  <link rel="stylesheet" href="/css/main.css?v=3">
  <link rel="stylesheet" href="/vendor/fonts/fonts.css">
  <link rel="stylesheet" href="/vendor/prism/prism-mocha.min.css">
</head>
<body>
  <div class="frame">
    <header>
      <nav>
        <a class="site-title" href="https://lobovit.github.io/">lobovit</a>
        <span class="nav-links">
          <a href="/page/about/">about</a>
          <a href="/page/contact/">contact</a>
        </span>
      </nav>
      <hr>
    </header>
    <main>
      
<article>
  <header>
    <h1>07 - AI Engineering from scratch: do self-attention ao speculative decoding</h1>
    <p class="meta"><time>2026-05-28</time> · <span class="tag">AI</span><span class="tag">transformers</span><span class="tag">attention</span><span class="tag">gpt</span><span class="tag">bert</span><span class="tag">llm</span><span class="tag">pytorch</span><span class="tag">python</span></p>
  </header>
  <div class="content">
    
<p>
Todo modelo que você usa em 2026, do GPT ao Claude, do Whisper ao Stable Diffusion, é um transformer. A arquitetura não mudou fundamentalmente desde 2017. O que mudou foi escala, dados e truques de engenharia que transformaram O(N²) de &#34;impraticável&#34; em &#34;roda no celular&#34;.</p>
<p>
Este artigo vai do zero ao speculative decoding em 16 tópicos. Você vai implementar self-attention em Python puro, entender por que RoPE substituiu embeddings posicionais, ver como Mixture of Experts empacota 671 bilhões de parâmetros em 37 bilhões ativos, e aprender o truque matemático que faz speculative decoding acelerar inferência 4x sem perder qualidade. Stack: Python pra treino, Go pra servir.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Por que transformers?
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
RNNs processam tokens um por um. O passo 100 espera o passo 99. Isso é O(N) em profundidade serial, e GPU detesta serial. Transformers processam todos os tokens em paralelo. O tradeoff é O(N²) de memória por O(1) de profundidade serial. A atenção é um broadcast: cada token olha pra todos os outros simultaneamente, e a GPU come isso com uma multiplicação de matrizes.</p>
<p>
Isso explica por que transformers dominam toda modalidade. O(N²) parecia um problema em 2017 (sequências de 512 tokens). Em 2026, com Flash Attention, KV cache, GQA e janelas deslizantes, sequências de 128k tokens são rotina. RNNs e state-space models (Mamba) ainda ganham em streaming e dispositivos mínimos, mas o transformer é o tronco principal da árvore.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Self-attention: o tijolo atômico
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
Self-attention é um lookup suave de banco de dados. Cada token projeta três vetores: Query (&#34;o que estou procurando?&#34;), Key (&#34;o que eu contenho?&#34;) e Value (&#34;o que eu ofereço?&#34;). O produto Q·K diz quão relevante cada par de tokens é. O softmax transforma isso em pesos. O output é a soma ponderada dos Values.</p>
<p>
A fórmula: <code>Attention(Q,K,V) = softmax(Q @ K^T / sqrt(d_k)) @ V</code>. A divisão por <code>sqrt(d_k)</code> evita que o softmax sature quando a dimensionalidade é alta (sem isso, os gradientes desaparecem). O resultado é uma matriz N×N onde cada célula (i,j) é o quanto o token i presta atenção no token j. Cada token de saída é uma mistura ponderada de todos os tokens de entrada.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">self_attention</span><span class="p">(</span><span class="n">X</span><span class="p">,</span> <span class="n">W_q</span><span class="p">,</span> <span class="n">W_k</span><span class="p">,</span> <span class="n">W_v</span><span class="p">,</span> <span class="n">causal</span><span class="o">=</span><span class="kc">False</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">Q</span><span class="p">,</span> <span class="n">K</span><span class="p">,</span> <span class="n">V</span> <span class="o">=</span> <span class="n">X</span> <span class="o">@</span> <span class="n">W_q</span><span class="p">,</span> <span class="n">X</span> <span class="o">@</span> <span class="n">W_k</span><span class="p">,</span> <span class="n">X</span> <span class="o">@</span> <span class="n">W_v</span>
</span></span><span class="line"><span class="cl">    <span class="n">d_k</span> <span class="o">=</span> <span class="n">Q</span><span class="o">.</span><span class="n">shape</span><span class="p">[</span><span class="o">-</span><span class="mi">1</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="n">scores</span> <span class="o">=</span> <span class="n">Q</span> <span class="o">@</span> <span class="n">K</span><span class="o">.</span><span class="n">T</span> <span class="o">/</span> <span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">d_k</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">if</span> <span class="n">causal</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="n">mask</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">triu</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">ones_like</span><span class="p">(</span><span class="n">scores</span><span class="p">)</span> <span class="o">*</span> <span class="o">-</span><span class="mf">1e9</span><span class="p">,</span> <span class="n">k</span><span class="o">=</span><span class="mi">1</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="n">scores</span> <span class="o">+=</span> <span class="n">mask</span>
</span></span><span class="line"><span class="cl">    <span class="n">weights</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">exp</span><span class="p">(</span><span class="n">scores</span> <span class="o">-</span> <span class="n">scores</span><span class="o">.</span><span class="n">max</span><span class="p">(</span><span class="n">axis</span><span class="o">=-</span><span class="mi">1</span><span class="p">,</span> <span class="n">keepdims</span><span class="o">=</span><span class="kc">True</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    <span class="n">weights</span> <span class="o">/=</span> <span class="n">weights</span><span class="o">.</span><span class="n">sum</span><span class="p">(</span><span class="n">axis</span><span class="o">=-</span><span class="mi">1</span><span class="p">,</span> <span class="n">keepdims</span><span class="o">=</span><span class="kc">True</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">weights</span> <span class="o">@</span> <span class="n">V</span><span class="p">,</span> <span class="n">weights</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Exemplo com 4 tokens, d_model=8</span>
</span></span><span class="line"><span class="cl"><span class="n">X</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">4</span><span class="p">,</span> <span class="mi">8</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">W_q</span><span class="p">,</span> <span class="n">W_k</span><span class="p">,</span> <span class="n">W_v</span> <span class="o">=</span> <span class="p">[</span><span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">8</span><span class="p">,</span> <span class="mi">8</span><span class="p">)</span> <span class="o">*</span> <span class="mf">0.02</span> <span class="k">for</span> <span class="n">_</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="mi">3</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl"><span class="n">output</span><span class="p">,</span> <span class="n">attn_weights</span> <span class="o">=</span> <span class="n">self_attention</span><span class="p">(</span><span class="n">X</span><span class="p">,</span> <span class="n">W_q</span><span class="p">,</span> <span class="n">W_k</span><span class="p">,</span> <span class="n">W_v</span><span class="p">)</span></span></span></code></pre></div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Multi-head: muitas atenções em paralelo**
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
Um único head de atenção aprende um tipo de relação (sujeito-verbo, por exemplo). Multi-head attention roda <code>h</code> heads em paralelo, cada um com dimensão reduzida (<code>d_k = d_model / h</code>), e concatena os resultados. Heads diferentes especializam em padrões diferentes, e a GPU executa tudo como uma única multiplicação de matrizes em lote. Adicionar heads é computacionalmente grátis.</p>
<p>
Grouped-Query Attention (GQA) é a variante de produção: todos os heads de query compartilham um conjunto menor de heads de key/value. Se você tem 32 heads de query e 8 heads de KV, o cache de inferência encolhe 4x. Llama 3, Qwen 2 e Mistral usam GQA. Multi-Query Attention (MQA) leva ao extremo com 1 head de KV. Multi-head Latent Attention (MLA, DeepSeek-V3) comprime KV ainda mais com projeções de baixo posto.</p>
</div>
</div>
