blog/content/post/ai-transformers-deep-dive.org
** Posicional encoding: onde cada token está**

Atenção é invariante à permutação. "O gato comeu o rato" e "O rato comeu o gato" produzem a mesma matriz de atenção porque os tokens são os mesmos. Algo precisa injetar posição.

Sinusoidal (Vaswani 2017) adiciona senos e cossenos de frequências diferentes diretamente aos embeddings. É histórica. RoPE (Su 2021) gira os vetores Q e K por ângulos que dependem da posição, de modo que o produto escalar entre Q na posição m e K na posição n depende apenas da diferença relativa (m - n). É o padrão universal de 2026: Llama, Qwen, Mistral, DeepSeek, todos usam RoPE. ALiBi (Press 2022) adiciona uma penalidade linear de distância aos scores de atenção, permitindo extrapolação de contexto sem custo de treino. Foi usada pelo BLOOM e MPT.

#+BEGIN_SRC python
def rope_rotate(q, k, pos, base=10000):
    d = q.shape[-1]
    theta = 1.0 / (base ** (np.arange(0, d, 2) / d))
    angles = pos * theta
    cos, sin = np.cos(angles), np.sin(angles)
    q_rot = q.copy(); k_rot = k.copy()
    q_rot[..., 0::2], q_rot[..., 1::2] = q[..., 0::2]*cos - q[..., 1::2]*sin, q[..., 0::2]*sin + q[..., 1::2]*cos
    k_rot[..., 0::2], k_rot[..., 1::2] = k[..., 0::2]*cos - k[..., 1::2]*sin, k[..., 0::2]*sin + k[..., 1::2]*cos
    return q_rot, k_rot
#+END_SRC

* O bloco transformer completo

O bloco transformer são seis peças, e todo modelo que você já ouviu falar é uma combinação delas:

- Embedding + sinal posicional (token + RoPE)
- Self-attention (multi-head, com máscara causal se for decoder)
- Feed-Forward Network (duas camadas densas com ativação)
- Residual connections (soma o input ao output de cada subcamada)
- Layer Normalization (estabiliza o treino)
- Cross-attention (só no decoder de encoder-decoder: olha pro output do encoder)

A modernização de 2017 pra 2026: LayerNorm virou RMSNorm (sem subtração da média, 10% mais rápida). ReLU virou SwiGLU (três matrizes em vez de duas, melhor uso de parâmetros). Sinusoidal virou RoPE. Multi-head completo virou GQA. Bias terms foram removidos (não ajudam e ocupam memória). O bloco moderno é: RMSNorm, GQA com RoPE, residual, RMSNorm, SwiGLU FFN, residual.

#+BEGIN_QUOTE
/Em miúdos:/ ~FFN~ (Feed-Forward Network) é uma mini-rede densa dentro do bloco transformer. Enquanto a atenção mistura informação entre tokens, a FFN processa cada token individualmente. Juntas, atenção + FFN formam o ciclo "olhe pros outros, pense sozinho". ~SwiGLU~ é uma FFN com três projeções lineares e ativação Swish com gate: ~Swish(W1·x) * W3·x, depois W2~. ~Residual connection~ é somar a entrada à saída (~y = x + F(x)~). Isso dá ao gradiente um caminho direto de volta e permite empilhar 100+ camadas.
#+END_QUOTE

** Três famílias de transformers**

Encoder-only (BERT, ModernBERT): self-attention bidirecional, sem máscara causal. Cada token vê todos os outros. Ideal pra classificação, NER, embeddings de busca, reranking cross-encoder. O [CLS] agrega a representação da frase inteira.

Decoder-only (GPT, Llama, Claude, Qwen, Mistral, DeepSeek): self-attention causal com máscara triangular superior. Cada token só vê o passado. É o que gera texto token a token. Domina 2026. O treino é paralelo (teacher forcing sobre a sequência inteira); a inferência é serial (um token por vez).

Encoder-decoder (T5, BART, Whisper): o encoder processa a entrada bidirecionalmente; o decoder gera a saída autoregressivamente, com cross-attention ao output do encoder em cada camada. Ideal pra tradução, sumarização, speech-to-text. O encoder roda uma vez; o decoder faz cross-attention ao mesmo output do encoder a cada passo.

* BERT, GPT, T5: as três escolas

** BERT: prever tokens mascarados**

BERT mascara 15% dos tokens e treina pra prever os originais usando contexto bidirecional. A regra 80/10/10: dos 15% mascarados, 80% viram [MASK], 10% viram tokens aleatórios, 10% permanecem iguais. Isso evita que o modelo decore o token [MASK] e force aprendizado real de linguagem. A loss é cross-entropy só nas posições mascaradas.

O [CLS] no início agrega a representação da frase inteira pra tarefas de classificação. O [SEP] separa segmentos (duas frases em tarefas de inferência). ModernBERT (2024) modernizou: RoPE, GeGLU, RMSNorm, atenção alternada local/global, contexto de 8k tokens.

BERT ainda é o backbone pra embeddings de recuperação (sentence-transformers), classificação, NER e reranking cross-encoder. Pra essas tarefas, atenção bidirecional é estritamente melhor que causal.

