ai-transformers-deep-dive/index.html
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Posicional encoding: onde cada token está**
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
Atenção é invariante à permutação. &#34;O gato comeu o rato&#34; e &#34;O rato comeu o gato&#34; produzem a mesma matriz de atenção porque os tokens são os mesmos. Algo precisa injetar posição.</p>
<p>
Sinusoidal (Vaswani 2017) adiciona senos e cossenos de frequências diferentes diretamente aos embeddings. É histórica. RoPE (Su 2021) gira os vetores Q e K por ângulos que dependem da posição, de modo que o produto escalar entre Q na posição m e K na posição n depende apenas da diferença relativa (m - n). É o padrão universal de 2026: Llama, Qwen, Mistral, DeepSeek, todos usam RoPE. ALiBi (Press 2022) adiciona uma penalidade linear de distância aos scores de atenção, permitindo extrapolação de contexto sem custo de treino. Foi usada pelo BLOOM e MPT.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">rope_rotate</span><span class="p">(</span><span class="n">q</span><span class="p">,</span> <span class="n">k</span><span class="p">,</span> <span class="n">pos</span><span class="p">,</span> <span class="n">base</span><span class="o">=</span><span class="mi">10000</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">d</span> <span class="o">=</span> <span class="n">q</span><span class="o">.</span><span class="n">shape</span><span class="p">[</span><span class="o">-</span><span class="mi">1</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="n">theta</span> <span class="o">=</span> <span class="mf">1.0</span> <span class="o">/</span> <span class="p">(</span><span class="n">base</span> <span class="o">**</span> <span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">arange</span><span class="p">(</span><span class="mi">0</span><span class="p">,</span> <span class="n">d</span><span class="p">,</span> <span class="mi">2</span><span class="p">)</span> <span class="o">/</span> <span class="n">d</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    <span class="n">angles</span> <span class="o">=</span> <span class="n">pos</span> <span class="o">*</span> <span class="n">theta</span>
</span></span><span class="line"><span class="cl">    <span class="n">cos</span><span class="p">,</span> <span class="n">sin</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">cos</span><span class="p">(</span><span class="n">angles</span><span class="p">),</span> <span class="n">np</span><span class="o">.</span><span class="n">sin</span><span class="p">(</span><span class="n">angles</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">q_rot</span> <span class="o">=</span> <span class="n">q</span><span class="o">.</span><span class="n">copy</span><span class="p">();</span> <span class="n">k_rot</span> <span class="o">=</span> <span class="n">k</span><span class="o">.</span><span class="n">copy</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">    <span class="n">q_rot</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">0</span><span class="p">::</span><span class="mi">2</span><span class="p">],</span> <span class="n">q_rot</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">1</span><span class="p">::</span><span class="mi">2</span><span class="p">]</span> <span class="o">=</span> <span class="n">q</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">0</span><span class="p">::</span><span class="mi">2</span><span class="p">]</span><span class="o">*</span><span class="n">cos</span> <span class="o">-</span> <span class="n">q</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">1</span><span class="p">::</span><span class="mi">2</span><span class="p">]</span><span class="o">*</span><span class="n">sin</span><span class="p">,</span> <span class="n">q</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">0</span><span class="p">::</span><span class="mi">2</span><span class="p">]</span><span class="o">*</span><span class="n">sin</span> <span class="o">+</span> <span class="n">q</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">1</span><span class="p">::</span><span class="mi">2</span><span class="p">]</span><span class="o">*</span><span class="n">cos</span>
</span></span><span class="line"><span class="cl">    <span class="n">k_rot</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">0</span><span class="p">::</span><span class="mi">2</span><span class="p">],</span> <span class="n">k_rot</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">1</span><span class="p">::</span><span class="mi">2</span><span class="p">]</span> <span class="o">=</span> <span class="n">k</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">0</span><span class="p">::</span><span class="mi">2</span><span class="p">]</span><span class="o">*</span><span class="n">cos</span> <span class="o">-</span> <span class="n">k</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">1</span><span class="p">::</span><span class="mi">2</span><span class="p">]</span><span class="o">*</span><span class="n">sin</span><span class="p">,</span> <span class="n">k</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">0</span><span class="p">::</span><span class="mi">2</span><span class="p">]</span><span class="o">*</span><span class="n">sin</span> <span class="o">+</span> <span class="n">k</span><span class="p">[</span><span class="o">...</span><span class="p">,</span> <span class="mi">1</span><span class="p">::</span><span class="mi">2</span><span class="p">]</span><span class="o">*</span><span class="n">cos</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">q_rot</span><span class="p">,</span> <span class="n">k_rot</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
O bloco transformer completo
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>
O bloco transformer são seis peças, e todo modelo que você já ouviu falar é uma combinação delas:</p>
<ul>
<li>Embedding + sinal posicional (token + RoPE)</li>
<li>Self-attention (multi-head, com máscara causal se for decoder)</li>
<li>Feed-Forward Network (duas camadas densas com ativação)</li>
<li>Residual connections (soma o input ao output de cada subcamada)</li>
<li>Layer Normalization (estabiliza o treino)</li>
<li>Cross-attention (só no decoder de encoder-decoder: olha pro output do encoder)</li>
</ul>
<p>A modernização de 2017 pra 2026: LayerNorm virou RMSNorm (sem subtração da média, 10% mais rápida). ReLU virou SwiGLU (três matrizes em vez de duas, melhor uso de parâmetros). Sinusoidal virou RoPE. Multi-head completo virou GQA. Bias terms foram removidos (não ajudam e ocupam memória). O bloco moderno é: RMSNorm, GQA com RoPE, residual, RMSNorm, SwiGLU FFN, residual.</p>
<blockquote>
<p><em>Em miúdos:</em> <code>FFN</code> (Feed-Forward Network) é uma mini-rede densa dentro do bloco transformer. Enquanto a atenção mistura informação entre tokens, a FFN processa cada token individualmente. Juntas, atenção + FFN formam o ciclo &#34;olhe pros outros, pense sozinho&#34;. <code>SwiGLU</code> é uma FFN com três projeções lineares e ativação Swish com gate: <code>Swish(W1·x) * W3·x, depois W2</code>. <code>Residual connection</code> é somar a entrada à saída (<code>y = x + F(x)</code>). Isso dá ao gradiente um caminho direto de volta e permite empilhar 100+ camadas.</p>
</blockquote>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Três famílias de transformers**
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
Encoder-only (BERT, ModernBERT): self-attention bidirecional, sem máscara causal. Cada token vê todos os outros. Ideal pra classificação, NER, embeddings de busca, reranking cross-encoder. O [CLS] agrega a representação da frase inteira.</p>
<p>
Decoder-only (GPT, Llama, Claude, Qwen, Mistral, DeepSeek): self-attention causal com máscara triangular superior. Cada token só vê o passado. É o que gera texto token a token. Domina 2026. O treino é paralelo (teacher forcing sobre a sequência inteira); a inferência é serial (um token por vez).</p>
<p>
Encoder-decoder (T5, BART, Whisper): o encoder processa a entrada bidirecionalmente; o decoder gera a saída autoregressivamente, com cross-attention ao output do encoder em cada camada. Ideal pra tradução, sumarização, speech-to-text. O encoder roda uma vez; o decoder faz cross-attention ao mesmo output do encoder a cada passo.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
BERT, GPT, T5: as três escolas
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
BERT: prever tokens mascarados**
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>
BERT mascara 15% dos tokens e treina pra prever os originais usando contexto bidirecional. A regra 80/10/10: dos 15% mascarados, 80% viram [MASK], 10% viram tokens aleatórios, 10% permanecem iguais. Isso evita que o modelo decore o token [MASK] e force aprendizado real de linguagem. A loss é cross-entropy só nas posições mascaradas.</p>
<p>
O [CLS] no início agrega a representação da frase inteira pra tarefas de classificação. O [SEP] separa segmentos (duas frases em tarefas de inferência). ModernBERT (2024) modernizou: RoPE, GeGLU, RMSNorm, atenção alternada local/global, contexto de 8k tokens.</p>
<p>
BERT ainda é o backbone pra embeddings de recuperação (sentence-transformers), classificação, NER e reranking cross-encoder. Pra essas tarefas, atenção bidirecional é estritamente melhor que causal.</p>
</div>
</div>
