ai-transformers-deep-dive/index.html
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
GPT: prever o próximo token**
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>
GPT é decoder-only. Uma máscara triangular superior de -inf nos scores de atenção é todo o mecanismo. O treino desloca a sequência em um: input = [t1..tk], target = [t2..t<sub>k+1</sub>], cross-entropy em todas as posições. É paralelo porque teacher forcing dá a resposta correta em cada passo.</p>
<p>
A geração é serial. Cinco estratégias de decoding controlam o equilíbrio entre qualidade e diversidade. Greedy (argmax, determinístico, repetitivo). Temperature (achata ou afia a distribuição; T&gt;1 mais criativo, T&lt;1 mais conservador). Top-k (restringe às k palavras mais prováveis). Top-p / nucleus (acumula probabilidade até bater um limiar). Min-p (filtra tokens com probabilidade abaixo de p_base * p_max).</p>
<p>
Todo LLM moderno é um decoder-only causal. A arquitetura não mudou desde o GPT-2. O que mudou foi escala de dados, tamanho do modelo, e pós-treinamento (RLHF, DPO).</p>
</div>
</div>
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
T5 e BART: encoder-decoder**
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>
Encoder-decoder é a arquitetura certa quando entrada e saída têm estruturas diferentes. O encoder processa a fonte bidirecionalmente (como BERT). O decoder gera autoregressivamente (como GPT), mas com cross-attention ao output do encoder em cada camada. Isso dá ao decoder acesso direto e repetido à fonte inteira, algo que decoder-only não tem.</p>
<p>
T5 usa span corruption: substitui trechos aleatórios do texto por tokens sentinela (&lt;X&gt;, &lt;Y&gt;) e treina o decoder pra gerar os trechos originais. BART corrompe o input de cinco formas diferentes (máscara, deleção, permutação, rotação, infilling) e treina o decoder pra reconstruir o original. Text infilling + sentence permutation foi a combinação vencedora.</p>
<p>
Whisper, Google Translate e Flan-T5 usam encoder-decoder. Decoder-only está absorvendo essas tarefas, mas encoder-decoder ainda ganha onde a modalidade de entrada é diferente ou beam search importa.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
Transformers além do texto
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
Vision Transformers (ViT)**
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>
Corte a imagem em patches 16x16. Achate cada patch num vetor. Alimente um transformer encoder padrão. Sem convoluções, sem inductive bias de visão. O patch size é a alavanca principal: patches menores dão mais tokens e melhor resolução, mas custo quadrático.</p>
<p>
ViT precisa de muitos dados (originalmente JFT-300M) porque não tem os priors que CNNs têm (invariância à translação, localidade). DINOv2 (2023) resolveu isso com pré-treinamento auto-supervisionado, produzindo embeddings que são o padrão pra features visuais genéricas em 2026. DeiT mostrou que data augmentation pesada (RandAugment, Mixup, CutMix) treina ViT no ImageNet sem dados externos.</p>
</div>
</div>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
Whisper: transformer para áudio**
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<p>
Áudio vira espectrograma log-mel (80 bins, 10 ms de stride, 3000 frames pra 30 segundos). Uma Conv1D reduz a dimensão temporal pela metade. O encoder transformer processa isso como se fossem tokens visuais. O decoder gera texto autoregressivamente com cross-attention ao encoder.</p>
<p>
Tokens de prompt (<code>&lt;|en|&gt;&lt;|transcribe|&gt;</code>) controlam tarefa e idioma. Um prefixo de 4 tokens é toda a superfície de controle. Beam search com largura 5 decodifica. Whisper-turbo (4 camadas no decoder) habilita voice agents em tempo real. A variante large-v3 atinge 1.6% WER em inglês.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-14" class="outline-2">
<h2 id="headline-14">
Mixture of Experts: mais parâmetros, mesmo custo
</h2>
<div id="outline-text-headline-14" class="outline-text-2">
<p>
Substitua cada FFN por E especialistas independentes + um roteador que escolhe k por token. Parâmetros totais = E x FFN_size. Parâmetros ativos = k x FFN_size. Isso desacopla capacidade de conhecimento de custo computacional por token.</p>
<p>
O roteador é uma camada linear que pontua cada token contra cada especialista. Top-k seleciona os melhores. Softmax sobre os escolhidos produz pesos de mistura. O output é a soma ponderada das saídas dos especialistas escolhidos. O desafio é balanceamento de carga: sem intervenção, o roteador colapsa em poucos especialistas e o resto nunca treina.</p>
<p>
DeepSeek-V3 resolveu isso com aux-loss-free balancing: cada especialista tem um bias ajustável fora da loss de treino. Especialistas sobre-utilizados ganham bias negativo; sub-utilizados ganham bias positivo. O bias afeta a seleção (top-k), mas não os pesos do gate (softmax). Especialistas finos (256 especialistas, cada token combina 8) dão C(256,8) = 400 trilhões de combinações possíveis por token.</p>
<p>
A fronteira de 2026 é quase toda MoE: DeepSeek-V3 (671B/37B ativos), Mixtral, Qwen-MoE, Llama 4, Kimi K2. O top 10 de modelos abertos nos benchmarks independentes é todo MoE.</p>
</div>
</div>
<div id="outline-container-headline-15" class="outline-2">
<h2 id="headline-15">
Inferência rápida: KV cache, Flash Attention, speculative decoding
</h2>
<div id="outline-text-headline-15" class="outline-text-2">
<p>
Treino é FLOP-bound (limitado por computação). Inferência é memory-bound (limitado por largura de banda de memória). Cada token gerado precisa acessar os pesos do modelo inteiro e o cache de todas as chaves e valores dos tokens anteriores. Otimizar inferência é otimizar acesso à memória.</p>
<div id="outline-container-headline-16" class="outline-3">
<h3 id="headline-16">
KV cache**
</h3>
<div id="outline-text-headline-16" class="outline-text-3">
<p>
Durante a geração autoregressiva, você recalcula Q, K e V pra todos os tokens a cada passo. Mas K e V dos tokens passados não mudam. Guarde-os. Cada novo token computa Q novo contra o cache de K/V acumulado. Isso reduz a atenção de O(N²) por passo pra O(N). Com GQA, o cache encolhe proportionalmente ao número de heads KV.</p>
</div>
</div>
<div id="outline-container-headline-17" class="outline-3">
<h3 id="headline-17">
Flash Attention**
</h3>
<div id="outline-text-headline-17" class="outline-text-3">
<p>
O bottleneck não é computar a matriz N×N de atenção. É mover ela entre HBM (memória da GPU, 3 TB/s na H100) e SRAM (cache on-chip, 30 TB/s). Flash Attention mantém a computação em SRAM. Carrega tiles de Q, K, V pra SRAM, computa S = Q @ K^T no tile, agrega softmax incrementalmente com running max e running sum, e só escreve o output final na HBM. Uma viagem de ida e volta por tile em vez de três por matriz N×N inteira. O resultado é exatamente igual ao attention padrão, bit a bit, mas 2-4x mais rápido e com pico de memória O(N) em vez de O(N²).</p>
</div>
</div>
<div id="outline-container-headline-18" class="outline-3">
<h3 id="headline-18">
PagedAttention e continuous batching**
</h3>
<div id="outline-text-headline-18" class="outline-text-3">
<p>
vLLM aloca o KV cache em blocos de 16 tokens com tabelas de páginas (como memória virtual). Isso elimina fragmentação e permite compartilhar cache entre requisições (prefix caching). Continuous batching troca requisições no meio do voo: quando uma requisição termina de gerar, outra entra imediatamente no mesmo batch, sem esperar as outras terminarem. Ganho de 5-10x em throughput.</p>
</div>
</div>
<div id="outline-container-headline-19" class="outline-3">
<h3 id="headline-19">
Speculative decoding**
</h3>
<div id="outline-text-headline-19" class="outline-text-3">
<p>
Um modelo draft barato (pequeno) propõe N tokens. O modelo verificador (grande) checa todos os N tokens em um único forward pass. Quando o draft acerta, você ganha N tokens pelo custo de 1. O truque matemático: aceite cada token do draft com probabilidade <code>min(1, q(token)/p(token))</code>, onde q é a distribuição do draft e p a do verificador. Se rejeitar, sampleie da distribuição residual <code>(p - q)_+ normalizada</code>. Isso garante que a distribuição final de saída é exatamente a do modelo verificador. Zero perda de qualidade, 2-4x de aceleração.</p>
<p>
Quatro famílias: vanilla (modelo draft separado, como Llama-70M + Llama-70B), Medusa (cabeças extras de LM que preveem t+1..t+k), EAGLE (transformer minúsculo condicionado nos hidden states do verificador, taxa de aceitação 0.85+), e lookahead (iteração de Jacobi, sem modelo draft). EAGLE-2/3 é o padrão pra Llama 3/4 e Qwen 3.</p>
</div>
</div>
</div>
</div>
